app/controllers/posts_controller.rb

  def update
    # raise params.inspect
    @post = Post.find(params[:id])
    @post.update(title: params[:title], description: params[:description])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "post 3  edited"], ["description", "content 3 edited"], ["updated_at", "2018-02-25 17:44:37.461560"], ["id", 6]]